MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA412/mcu.h
extern volatile DMAINT2BITS DMAINT2bits __attribute__((__sfr__));

#define DMASRC2 DMASRC2
extern volatile uint16_t DMASRC2 __attribute__((__sfr__));
#define DMADST2 DMADST2
extern volatile uint16_t DMADST2 __attribute__((__sfr__));
#define DMACNT2 DMACNT2
extern volatile uint16_t DMACNT2 __attribute__((__sfr__));
#define DMACH3 DMACH3
extern volatile uint16_t DMACH3 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH3BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH3BITS;
extern volatile DMACH3BITS DMACH3bits __attribute__((__sfr__));

#define DMAINT3 DMAINT3
extern volatile uint16_t DMAINT3 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT3BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT3BITS;
extern volatile DMAINT3BITS DMAINT3bits __attribute__((__sfr__));

#define DMASRC3 DMASRC3
extern volatile uint16_t DMASRC3 __attribute__((__sfr__));
#define DMADST3 DMADST3
extern volatile uint16_t DMADST3 __attribute__((__sfr__));
#define DMACNT3 DMACNT3
extern volatile uint16_t DMACNT3 __attribute__((__sfr__));
#define DMACH4 DMACH4
extern volatile uint16_t DMACH4 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH4BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH4BITS;
extern volatile DMACH4BITS DMACH4bits __attribute__((__sfr__));

#define DMAINT4 DMAINT4
extern volatile uint16_t DMAINT4 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT4BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT4BITS;
extern volatile DMAINT4BITS DMAINT4bits __attribute__((__sfr__));

#define DMASRC4 DMASRC4
extern volatile uint16_t DMASRC4 __attribute__((__sfr__));
#define DMADST4 DMADST4
extern volatile uint16_t DMADST4 __attribute__((__sfr__));
#define DMACNT4 DMACNT4
extern volatile uint16_t DMACNT4 __attribute__((__sfr__));
#define DMACH5 DMACH5
extern volatile uint16_t DMACH5 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH5BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH5BITS;
extern volatile DMACH5BITS DMACH5bits __attribute__((__sfr__));

#define DMAINT5 DMAINT5
extern volatile uint16_t DMAINT5 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT5BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT5BITS;
extern volatile DMAINT5BITS DMAINT5bits __attribute__((__sfr__));

#define DMASRC5 DMASRC5
extern volatile uint16_t DMASRC5 __attribute__((__sfr__));
#define DMADST5 DMADST5
extern volatile uint16_t DMADST5 __attribute__((__sfr__));
#define DMACNT5 DMACNT5
extern volatile uint16_t DMACNT5 __attribute__((__sfr__));
#define CRYCONL CRYCONL
extern volatile uint16_t CRYCONL __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONLBITS {
  union {
    struct {
      uint16_t CPHRMOD:3;
      uint16_t CPHRSEL:1;
      uint16_t OPMOD:4;
      uint16_t CRYGO:1;
      uint16_t :1;
      uint16_t FREEIE:1;
      uint16_t DONEIE:1;
      uint16_t ROLLIE:1;
      uint16_t CRYSIDL:1;
      uint16_t :1;
      uint16_t CRYON:1;
    };
    struct {
      uint16_t CPHRMOD0:1;
      uint16_t CPHRMOD1:1;
      uint16_t CPHRMOD2:1;
      uint16_t :1;
      uint16_t OPMOD0:1;
      uint16_t OPMOD1:1;
      uint16_t OPMOD2:1;
      uint16_t OPMOD3:1;
    };
  };
} CRYCONLBITS;
extern volatile CRYCONLBITS CRYCONLbits __attribute__((__sfr__));

#define CRYCONH CRYCONH
extern volatile uint16_t CRYCONH __attribute__((__sfr__));
__extension__ typedef struct tagCRYCONHBITS {
  union {
    struct {
      uint16_t KEYSRC:4;
      uint16_t KEYWIPE:1;
      uint16_t KEYMOD:2;
      uint16_t SKEYSEL:1;
      uint16_t CTRSIZE:7;
    };
    struct {
      uint16_t KEYSRC0:1;
      uint16_t KEYSRC1:1;
      uint16_t KEYSRC2:1;
      uint16_t KEYSRC3:1;
      uint16_t :1;
      uint16_t KEYMOD0:1;
      uint16_t KEYMOD1:1;
      uint16_t :1;
      uint16_t CTRSIZE0:1;
      uint16_t CTRSIZE1:1;
      uint16_t CTRSIZE2:1;
      uint16_t CTRSIZE3:1;
      uint16_t CTRSIZE4:1;
      uint16_t CTRSIZE5:1;
      uint16_t CTRSIZE6:1;
    };
  };
} CRYCONHBITS;
extern volatile CRYCONHBITS CRYCONHbits __attribute__((__sfr__));

