MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA412/mcu.h
extern volatile LCDDATA16BITS LCDDATA16bits __attribute__((__sfr__));

#define LCDDATA17 LCDDATA17
extern volatile uint16_t LCDDATA17 __attribute__((__sfr__));
typedef struct tagLCDDATA17BITS {
  uint16_t S16C4:1;
  uint16_t S17C4:1;
  uint16_t S18C4:1;
  uint16_t S19C4:1;
  uint16_t S20C4:1;
  uint16_t S21C4:1;
  uint16_t S22C4:1;
  uint16_t S23C4:1;
  uint16_t S24C4:1;
  uint16_t S25C4:1;
  uint16_t S26C4:1;
  uint16_t S27C4:1;
  uint16_t S28C4:1;
  uint16_t S29C4:1;
  uint16_t S30C4:1;
  uint16_t S31C4:1;
} LCDDATA17BITS;
extern volatile LCDDATA17BITS LCDDATA17bits __attribute__((__sfr__));

#define LCDDATA18 LCDDATA18
extern volatile uint16_t LCDDATA18 __attribute__((__sfr__));
typedef struct tagLCDDATA18BITS {
  uint16_t S32C4:1;
  uint16_t S33C4:1;
  uint16_t S34C4:1;
  uint16_t S35C4:1;
  uint16_t S36C4:1;
  uint16_t S37C4:1;
  uint16_t S38C4:1;
  uint16_t S39C4:1;
  uint16_t S40C4:1;
  uint16_t S41C4:1;
  uint16_t S42C4:1;
  uint16_t S43C4:1;
  uint16_t S44C4:1;
  uint16_t S45C4:1;
  uint16_t S46C4:1;
  uint16_t S47C4:1;
} LCDDATA18BITS;
extern volatile LCDDATA18BITS LCDDATA18bits __attribute__((__sfr__));

#define LCDDATA19 LCDDATA19
extern volatile uint16_t LCDDATA19 __attribute__((__sfr__));
typedef struct tagLCDDATA19BITS {
  uint16_t S48C4:1;
  uint16_t S49C4:1;
  uint16_t S50C4:1;
  uint16_t S51C4:1;
  uint16_t S52C4:1;
  uint16_t S53C4:1;
  uint16_t S54C4:1;
  uint16_t S55C4:1;
  uint16_t S56C4:1;
  uint16_t S57C4:1;
  uint16_t S58C4:1;
  uint16_t S59C4:1;
  uint16_t S60C4:1;
  uint16_t S61C4:1;
  uint16_t S62C4:1;
  uint16_t S63C4:1;
} LCDDATA19BITS;
extern volatile LCDDATA19BITS LCDDATA19bits __attribute__((__sfr__));

#define LCDDATA20 LCDDATA20
extern volatile uint16_t LCDDATA20 __attribute__((__sfr__));
typedef struct tagLCDDATA20BITS {
  uint16_t S00C5:1;
  uint16_t S01C5:1;
  uint16_t S02C5:1;
  uint16_t S03C5:1;
  uint16_t S04C5:1;
  uint16_t S05C5:1;
  uint16_t S06C5:1;
  uint16_t S07C5:1;
  uint16_t S08C5:1;
  uint16_t S09C5:1;
  uint16_t S10C5:1;
  uint16_t S11C5:1;
  uint16_t S12C5:1;
  uint16_t S13C5:1;
  uint16_t S14C5:1;
  uint16_t S15C5:1;
} LCDDATA20BITS;
extern volatile LCDDATA20BITS LCDDATA20bits __attribute__((__sfr__));

#define LCDDATA21 LCDDATA21
extern volatile uint16_t LCDDATA21 __attribute__((__sfr__));
typedef struct tagLCDDATA21BITS {
  uint16_t S16C5:1;
  uint16_t S17C5:1;
  uint16_t S18C5:1;
  uint16_t S19C5:1;
  uint16_t S20C5:1;
  uint16_t S21C5:1;
  uint16_t S22C5:1;
  uint16_t S23C5:1;
  uint16_t S24C5:1;
  uint16_t S25C5:1;
  uint16_t S26C5:1;
  uint16_t S27C5:1;
  uint16_t S28C5:1;
  uint16_t S29C5:1;
  uint16_t S30C5:1;
  uint16_t S31C5:1;
} LCDDATA21BITS;
extern volatile LCDDATA21BITS LCDDATA21bits __attribute__((__sfr__));

#define LCDDATA22 LCDDATA22
extern volatile uint16_t LCDDATA22 __attribute__((__sfr__));
typedef struct tagLCDDATA22BITS {
  uint16_t S32C5:1;
  uint16_t S33C5:1;
  uint16_t S34C5:1;
  uint16_t S35C5:1;
  uint16_t S36C5:1;
  uint16_t S37C5:1;
  uint16_t S38C5:1;
  uint16_t S39C5:1;
  uint16_t S40C5:1;
  uint16_t S41C5:1;
  uint16_t S42C5:1;
  uint16_t S43C5:1;
  uint16_t S44C5:1;
  uint16_t S45C5:1;
  uint16_t S46C5:1;
  uint16_t S47C5:1;
} LCDDATA22BITS;
extern volatile LCDDATA22BITS LCDDATA22bits __attribute__((__sfr__));

#define LCDDATA23 LCDDATA23
extern volatile uint16_t LCDDATA23 __attribute__((__sfr__));
typedef struct tagLCDDATA23BITS {
  uint16_t S48C5:1;
  uint16_t S49C5:1;
  uint16_t S50C5:1;
  uint16_t S51C5:1;
  uint16_t S52C5:1;
  uint16_t S53C5:1;
  uint16_t S54C5:1;
  uint16_t S55C5:1;
  uint16_t S56C5:1;
  uint16_t S57C5:1;
  uint16_t S58C5:1;
  uint16_t S59C5:1;
  uint16_t S60C5:1;
  uint16_t S61C5:1;
  uint16_t S62C5:1;
  uint16_t S63C5:1;
} LCDDATA23BITS;
extern volatile LCDDATA23BITS LCDDATA23bits __attribute__((__sfr__));

#define LCDDATA24 LCDDATA24
extern volatile uint16_t LCDDATA24 __attribute__((__sfr__));
typedef struct tagLCDDATA24BITS {
  uint16_t S00C6:1;
  uint16_t S01C6:1;
  uint16_t S02C6:1;
  uint16_t S03C6:1;
  uint16_t S04C6:1;
  uint16_t S05C6:1;
  uint16_t S06C6:1;
  uint16_t S07C6:1;
  uint16_t S08C6:1;
  uint16_t S09C6:1;
  uint16_t S10C6:1;
  uint16_t S11C6:1;
  uint16_t S12C6:1;
  uint16_t S13C6:1;
  uint16_t S14C6:1;
  uint16_t S15C6:1;
} LCDDATA24BITS;
extern volatile LCDDATA24BITS LCDDATA24bits __attribute__((__sfr__));

#define LCDDATA25 LCDDATA25
extern volatile uint16_t LCDDATA25 __attribute__((__sfr__));
typedef struct tagLCDDATA25BITS {
  uint16_t S16C6:1;
  uint16_t S17C6:1;
  uint16_t S18C6:1;
  uint16_t S19C6:1;
  uint16_t S20C6:1;
  uint16_t S21C6:1;
  uint16_t S22C6:1;
  uint16_t S23C6:1;
  uint16_t S24C6:1;
  uint16_t S25C6:1;
  uint16_t S26C6:1;
  uint16_t S27C6:1;
  uint16_t S28C6:1;
  uint16_t S29C6:1;
  uint16_t S30C6:1;
  uint16_t S31C6:1;
} LCDDATA25BITS;
extern volatile LCDDATA25BITS LCDDATA25bits __attribute__((__sfr__));

#define LCDDATA26 LCDDATA26
extern volatile uint16_t LCDDATA26 __attribute__((__sfr__));
typedef struct tagLCDDATA26BITS {
  uint16_t S32C6:1;
  uint16_t S33C6:1;
  uint16_t S34C6:1;
  uint16_t S35C6:1;
  uint16_t S36C6:1;
  uint16_t S37C6:1;
  uint16_t S38C6:1;
  uint16_t S39C6:1;
  uint16_t S40C6:1;
  uint16_t S41C6:1;
  uint16_t S42C6:1;
  uint16_t S43C6:1;
  uint16_t S44C6:1;
  uint16_t S45C6:1;
  uint16_t S46C6:1;
  uint16_t S47C6:1;
} LCDDATA26BITS;
extern volatile LCDDATA26BITS LCDDATA26bits __attribute__((__sfr__));

#define LCDDATA27 LCDDATA27
extern volatile uint16_t LCDDATA27 __attribute__((__sfr__));
typedef struct tagLCDDATA27BITS {
  uint16_t S48C6:1;
  uint16_t S49C6:1;
  uint16_t S50C6:1;
  uint16_t S51C6:1;
  uint16_t S52C6:1;
  uint16_t S53C6:1;
  uint16_t S54C6:1;
  uint16_t S55C6:1;
  uint16_t S56C6:1;
  uint16_t S57C6:1;
  uint16_t S58C6:1;
  uint16_t S59C6:1;
  uint16_t S60C6:1;
  uint16_t S61C6:1;
  uint16_t S62C6:1;
  uint16_t S63C6:1;
} LCDDATA27BITS;
extern volatile LCDDATA27BITS LCDDATA27bits __attribute__((__sfr__));

#define LCDDATA28 LCDDATA28
extern volatile uint16_t LCDDATA28 __attribute__((__sfr__));
typedef struct tagLCDDATA28BITS {
  uint16_t S00C7:1;
  uint16_t S01C7:1;
  uint16_t S02C7:1;
  uint16_t S03C7:1;
  uint16_t S04C7:1;
  uint16_t S05C7:1;
  uint16_t S06C7:1;
  uint16_t S07C7:1;
  uint16_t S08C7:1;
  uint16_t S09C7:1;
  uint16_t S10C7:1;
  uint16_t S11C7:1;
  uint16_t S12C7:1;
  uint16_t S13C7:1;
  uint16_t S14C7:1;
  uint16_t S15C7:1;
} LCDDATA28BITS;
extern volatile LCDDATA28BITS LCDDATA28bits __attribute__((__sfr__));

#define LCDDATA29 LCDDATA29
extern volatile uint16_t LCDDATA29 __attribute__((__sfr__));
typedef struct tagLCDDATA29BITS {
  uint16_t S16C7:1;
  uint16_t S17C7:1;
  uint16_t S18C7:1;
  uint16_t S19C7:1;
  uint16_t S20C7:1;
  uint16_t S21C7:1;
  uint16_t S22C7:1;
  uint16_t S23C7:1;
  uint16_t S24C7:1;
  uint16_t S25C7:1;
  uint16_t S26C7:1;
  uint16_t S27C7:1;
  uint16_t S28C7:1;
  uint16_t S29C7:1;
  uint16_t S30C7:1;
  uint16_t S31C7:1;
} LCDDATA29BITS;
