MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA412/mcu.h
#define CNPDE CNPDE
extern volatile uint16_t CNPDE __attribute__((__sfr__));
__extension__ typedef struct tagCNPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
      uint16_t IOCPDE8:1;
      uint16_t IOCPDE9:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
      uint16_t CNPDE8:1;
      uint16_t CNPDE9:1;
    };
  };
} CNPDEBITS;
extern volatile CNPDEBITS CNPDEbits __attribute__((__sfr__));

#define IOCPDE IOCPDE
extern volatile uint16_t IOCPDE __attribute__((__sfr__));
__extension__ typedef struct tagIOCPDEBITS {
  union {
    struct {
      uint16_t IOCPDE0:1;
      uint16_t IOCPDE1:1;
      uint16_t IOCPDE2:1;
      uint16_t IOCPDE3:1;
      uint16_t IOCPDE4:1;
      uint16_t IOCPDE5:1;
      uint16_t IOCPDE6:1;
      uint16_t IOCPDE7:1;
      uint16_t IOCPDE8:1;
      uint16_t IOCPDE9:1;
    };
    struct {
      uint16_t CNPDE0:1;
      uint16_t CNPDE1:1;
      uint16_t CNPDE2:1;
      uint16_t CNPDE3:1;
      uint16_t CNPDE4:1;
      uint16_t CNPDE5:1;
      uint16_t CNPDE6:1;
      uint16_t CNPDE7:1;
      uint16_t CNPDE8:1;
      uint16_t CNPDE9:1;
    };
  };
} IOCPDEBITS;
extern volatile IOCPDEBITS IOCPDEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
  uint16_t TRISF7:1;
  uint16_t TRISF8:1;
  uint16_t :3;
  uint16_t TRISF12:1;
  uint16_t TRISF13:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t RF2:1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
  uint16_t RF7:1;
  uint16_t RF8:1;
  uint16_t :3;
  uint16_t RF12:1;
  uint16_t RF13:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t LATF2:1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
  uint16_t LATF7:1;
  uint16_t LATF8:1;
  uint16_t :3;
  uint16_t LATF12:1;
  uint16_t LATF13:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define ODCF ODCF
extern volatile uint16_t ODCF __attribute__((__sfr__));
typedef struct tagODCFBITS {
  uint16_t ODCF0:1;
  uint16_t ODCF1:1;
  uint16_t ODCF2:1;
  uint16_t ODCF3:1;
  uint16_t ODCF4:1;
  uint16_t ODCF5:1;
  uint16_t ODCF6:1;
  uint16_t ODCF7:1;
  uint16_t ODCF8:1;
  uint16_t :3;
  uint16_t ODCF12:1;
  uint16_t ODCF13:1;
} ODCFBITS;
extern volatile ODCFBITS ODCFbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
__extension__ typedef struct tagANSELFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t ANSF1:1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :2;
      uint16_t ANSF8:1;
      uint16_t :3;
      uint16_t ANSF12:1;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t ANSELF1:1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :2;
      uint16_t ANSELF8:1;
      uint16_t :3;
      uint16_t ANSELF12:1;
      uint16_t ANSELF13:1;
    };
  };
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define ANSF ANSF
extern volatile uint16_t ANSF __attribute__((__sfr__));
__extension__ typedef struct tagANSFBITS {
  union {
    struct {
      uint16_t ANSF0:1;
      uint16_t ANSF1:1;
      uint16_t ANSF2:1;
      uint16_t ANSF3:1;
      uint16_t ANSF4:1;
      uint16_t ANSF5:1;
      uint16_t :2;
      uint16_t ANSF8:1;
      uint16_t :3;
      uint16_t ANSF12:1;
      uint16_t ANSF13:1;
    };
    struct {
      uint16_t ANSELF0:1;
      uint16_t ANSELF1:1;
      uint16_t ANSELF2:1;
      uint16_t ANSELF3:1;
      uint16_t ANSELF4:1;
      uint16_t ANSELF5:1;
      uint16_t :2;
      uint16_t ANSELF8:1;
      uint16_t :3;
      uint16_t ANSELF12:1;
      uint16_t ANSELF13:1;
    };
  };
} ANSFBITS;
extern volatile ANSFBITS ANSFbits __attribute__((__sfr__));

#define IOCPF IOCPF
extern volatile uint16_t IOCPF __attribute__((__sfr__));
typedef struct tagIOCPFBITS {
  uint16_t IOCPF0:1;
  uint16_t IOCPF1:1;
  uint16_t IOCPF2:1;
  uint16_t IOCPF3:1;
  uint16_t IOCPF4:1;
  uint16_t IOCPF5:1;
  uint16_t IOCPF6:1;
  uint16_t IOCPF7:1;
  uint16_t IOCPF8:1;
  uint16_t :3;
  uint16_t IOCPF12:1;
  uint16_t IOCPF13:1;
} IOCPFBITS;
extern volatile IOCPFBITS IOCPFbits __attribute__((__sfr__));

#define IOCNF IOCNF
extern volatile uint16_t IOCNF __attribute__((__sfr__));
typedef struct tagIOCNFBITS {
  uint16_t IOCNF0:1;
  uint16_t IOCNF1:1;
  uint16_t IOCNF2:1;
  uint16_t IOCNF3:1;
  uint16_t IOCNF4:1;
  uint16_t IOCNF5:1;
  uint16_t IOCNF6:1;
  uint16_t IOCNF7:1;
  uint16_t IOCNF8:1;
  uint16_t :3;
  uint16_t IOCNF12:1;
  uint16_t IOCNF13:1;
} IOCNFBITS;
extern volatile IOCNFBITS IOCNFbits __attribute__((__sfr__));

#define IOCFF IOCFF
extern volatile uint16_t IOCFF __attribute__((__sfr__));
typedef struct tagIOCFFBITS {
  uint16_t IOCFF0:1;
  uint16_t IOCFF1:1;
  uint16_t IOCFF2:1;
  uint16_t IOCFF3:1;
  uint16_t IOCFF4:1;
  uint16_t IOCFF5:1;
  uint16_t IOCFF6:1;
  uint16_t IOCFF7:1;
  uint16_t IOCFF8:1;
  uint16_t :3;
  uint16_t IOCFF12:1;
  uint16_t IOCFF13:1;
} IOCFFBITS;
extern volatile IOCFFBITS IOCFFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
__extension__ typedef struct tagCNPUFBITS {
  union {
    struct {
      uint16_t IOCPF0:1;
      uint16_t IOCPF1:1;
      uint16_t IOCPF2:1;
      uint16_t IOCPF3:1;
      uint16_t IOCPF4:1;
      uint16_t IOCPF5:1;
      uint16_t IOCPF6:1;
      uint16_t IOCPF7:1;
      uint16_t IOCPF8:1;
      uint16_t :3;
      uint16_t IOCPF12:1;
      uint16_t IOCPF13:1;
    };
    struct {
      uint16_t IOCPUF0:1;
      uint16_t IOCPUF1:1;
      uint16_t IOCPUF2:1;
      uint16_t IOCPUF3:1;
      uint16_t IOCPUF4:1;
      uint16_t IOCPUF5:1;
      uint16_t IOCPUF6:1;
      uint16_t IOCPUF7:1;
      uint16_t IOCPUF8:1;
      uint16_t :3;
      uint16_t IOCPUF12:1;
      uint16_t IOCPUF13:1;
    };
    struct {
      uint16_t CNPUF0:1;
      uint16_t CNPUF1:1;
      uint16_t CNPUF2:1;
      uint16_t CNPUF3:1;
      uint16_t CNPUF4:1;
      uint16_t CNPUF5:1;
      uint16_t CNPUF6:1;
      uint16_t CNPUF7:1;
      uint16_t CNPUF8:1;
      uint16_t :3;
      uint16_t CNPUF12:1;
      uint16_t CNPUF13:1;
    };
  };
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

